Repository: FlipByBlink/PlainShogi
Catalog: iOS + visionOS/サポートファイル/ローカライズ/visionOS/🌐VersionHistory.xcstrings
Source language: ja
Languages: en

# 1.0
source: 最初のリリース
en: Initial release

# 1.1
source: 駒を英語表記に変更する機能を追加 プレーンテキスト書き出し/読み込み機能を追加 ソースコードをアプリ内で確認する機能を追加 セルフ広告バナーを追加 枠線を非表示するオプションを削除 その他、細かな改善をいくつか実施
en: Add english term option Add plain text export/import function Add function to check source code in app Add self-AD banner Delete option to hide edge line Small fix/improve

# 1.2
source: - 盤面の駒を盤外へ直接移動できるように変更 - 簡単に駒を消したり増やしたりする機能の追加 - 初期化等のショートカットをメニューボタン長押しで呼び出す機能を追加 - 手駒を3回タップして消す機能の削除 - アプリ内課金で広告非表示にできる機能を実装 - アプリ内広告バナーの表示頻度を「3回起動毎に起動直後1回」から「起動6回以降は起動直後毎回」に変更 - 広くリファクタリング - いくつかの小さめの改善やバグ修正
en: - Directly move a piece to out-of-board - Add Edit Mode - Add shortcut function by long press menu button - Delete function to delete a piece by 3 tapping - Add In-App Purchase to hide AD - Change frequency in AD ("1 in 3" → "after 5, every") - Widely refactoring - Various bugfixes and improvements

# 1.2.1
source: 軽微なバグ修正
en: small bug fix

# 1.2.2
source: 駒を持ち上げた際の見た目を調整 軽微なバグ修正
en: Adjust the look on dragging a piece small bug fix

# 1.3
source: SharePlayに対応しました。 操作直後の駒を目立たせるようにしました。 段と筋を表示するようにしました。 盤面を上下反転させるオプション。 敵陣に入った際に成駒確認ダイアログを表示するようにしました。 無操作時にスリープしないようにしました。 履歴機能を追加しました。 局面復元機能を追加しました。 駒のフォントサイズを大きくしました。 広告のデザインを変更しました。 その他、いくつかの小さめの改善やバグ修正をしました。
en: Support SharePlay. Show shift sign. Show 段(dan) and 筋(suji). Reverse vertically option. Promotion dialog. Avoid device sleep. History function. Add restore function. Bigger 駒(koma) font. Change AD design. Various bug-fixes and improvements

# 1.4
source: タップで移動する機能の追加。 iCloudによるデバイス間同期の追加。 アプリ内でのフォントカスタマイズ機能の追加。 横向きレイアウトに対応。 セリフ体フォントオプションの追加。 ブックマーク機能の追加。 キーボードショートカットの追加(iPad、 Mac)。 Macのサポートを追加。 Apple TVのサポートを追加。 Apple Watchのサポートを追加。 非日本語環境でのフォント表示の改善。 その他、いくつかの小さめの改善やバグ修正。
en: ADD Move by tap. ADD Sync by iCloud. ADD Font customize option in app. ADD Landscape layout. ADD Serif font option. ADD Bookmark. ADD Keyboard shortcut(iPad, Mac). ADD Mac support. ADD Apple TV support. ADD Apple Watch support. IMPROVE Font rendering on non-japanese environment. OTHER Various bug-fixes and improvements.

# 1.5
source: 画像書き出し機能を追加。 iPhone同士を近付けることでSharePlayを開始できる機能に対応(iOS 17のみ)。 メイン画面に共有ボタンを追加。 iOS 15.xを非対応にしました。
en: Support for export to image format. Support NameDrop style SharePlay(iOS17). Add share button in main screen. Unsupport iOS 15.x.

# 1.5.1
source: 画像書き出し機能が失敗する不具合を修正しました
en: Fix a bug of image-export

# 1.6
source: 効果音の追加。 SharePlayにて駒選択状態の同期を追加。 Apple Vision Proのサポートを追加。
en: Add sound effect. Sync selection state on SharePlay. Add Apple Vision Pro support.
